[
  {
    "id": "p001",
    "condition": "0px nearest-neighbor distance on many pairs",
    "insight": "Elements at 0px distance are touching or overlapping — they form continuous visual surfaces. This construction uses stacked shapes for shading, gradient simulation, or color regions rather than discrete separate parts. Read the stacking tree to see layering order.",
    "confidence": 0.85,
    "times_confirmed": 1,
    "times_contradicted": 0,
    "tags": ["organic"]
  },
  {
    "id": "p002",
    "condition": "concentric groups of 2-3 elements",
    "insight": "Concentric groups (elements sharing a center) are multi-ring constructions — a detail feature built from layered shapes. Their position relative to the largest containing element and their size tier determine their structural role.",
    "confidence": 0.85,
    "times_confirmed": 1,
    "times_contradicted": 0,
    "tags": ["circular"]
  },
  {
    "id": "p003",
    "condition": "deep nesting (3+ containment levels), 40+ elements",
    "insight": "Deep nesting with many elements indicates hierarchical assembly — large shapes contain medium shapes which contain small shapes. Analyze the stacking tree level by level rather than element by element. Each nesting level represents a different construction layer.",
    "confidence": 0.85,
    "times_confirmed": 1,
    "times_contradicted": 0,
    "tags": ["organic"]
  },
  {
    "id": "p004",
    "condition": "high overlap count (IoU > 0.3 in 10+ pairs)",
    "insight": "Dense overlapping means shapes are stacked on top of each other — layered construction building up regions. The stacking tree reveals the layering order. Don't interpret each shape independently — they combine to form composite regions.",
    "confidence": 0.8,
    "times_confirmed": 1,
    "times_contradicted": 0,
    "tags": ["organic"]
  },
  {
    "id": "p005",
    "condition": "one dominant spatial cluster + smaller satellite clusters",
    "insight": "When one cluster contains most elements and smaller clusters sit at edges, the dominant cluster is the main mass. Satellite clusters are extensions or separate sub-assemblies. Analyze each cluster's internal structure independently, then consider how they connect.",
    "confidence": 0.8,
    "times_confirmed": 1,
    "times_contradicted": 0,
    "tags": ["organic"]
  },
  {
    "id": "p006",
    "condition": "symmetry pairs present but moderate score (0.4-0.7)",
    "insight": "Moderate symmetry with defined mirror pairs means some elements are mirrored across an axis while the overall composition is not symmetric. The paired elements share structural function. Elements ON the axis (unpaired) are typically central features.",
    "confidence": 0.8,
    "times_confirmed": 1,
    "times_contradicted": 0,
    "tags": ["organic"]
  },
  {
    "id": "p007",
    "condition": "large non-convex element (convexity < 0.6) with high area",
    "insight": "A large element with low convexity has distinct sub-parts — concavities divide it into regions. The convex hull ratio tells you how much branching or indentation exists. Combined with the element's position relative to the main mass, this reveals the overall structural topology.",
    "confidence": 0.8,
    "times_confirmed": 1,
    "times_contradicted": 0,
    "tags": ["organic"]
  },
  {
    "id": "p008",
    "condition": "positive space grid shows curved, non-rectangular silhouette",
    "insight": "Read the positive space grid as a low-resolution thumbnail. Trace the boundary between X and dot — that is the silhouette outline. Curved non-rectangular boundaries indicate non-geometric construction. The grid shape is often more informative than individual element properties.",
    "confidence": 0.9,
    "times_confirmed": 1,
    "times_contradicted": 0,
    "tags": ["organic"]
  },
  {
    "id": "p009",
    "condition": "fill percentage < 15% despite many elements",
    "insight": "Low fill percentage with many elements means stroke-based or outline-only rendering. The shapes exist as boundaries, not as filled regions. The visual result may appear solid to a viewer but the SVG construction uses outlines. Don't confuse SVG rendering technique with visual appearance.",
    "confidence": 0.85,
    "times_confirmed": 1,
    "times_contradicted": 0,
    "tags": ["circular"]
  },
  {
    "id": "p010",
    "condition": "strong symmetry (score > 0.85) with few elements (< 10)",
    "insight": "High bilateral symmetry with few elements indicates intentional geometric construction — likely a designed symbol, icon, or simple illustration. The symmetry axis and paired elements define the compositional structure directly.",
    "confidence": 0.85,
    "times_confirmed": 1,
    "times_contradicted": 0,
    "tags": ["circular"]
  }
]
